---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegment.IsTextPositionAdjustable
source: html/9f316c9b-ebb4-a3d3-781d-3cf0726b352e.htm
---
# Autodesk.Revit.DB.DimensionSegment.IsTextPositionAdjustable Method

Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.

## Syntax (C#)
```csharp
public bool IsTextPositionAdjustable()
```

## Returns
True if this dimension is supported to set/get TextPosition/LeaderPosition, false otherwise.